IDOK                                          = "OK"
IDCANCEL                                      = "Cancel"
IDAPPLY                                       = "Apply"
IDCLOSE                                       = "Close"
IDDEFAULT                                     = "Default"

ID_ADD                                        = "Add"
ID_DELETE                                     = "Delete"
ID_INSERT                                     = "Insert"

ID_SEISMIC_FRAME_TYPE_SMF                     = "SMF"
ID_SEISMIC_FRAME_TYPE_IMF                     = "IMF"
ID_SEISMIC_FRAME_TYPE_OMF                     = "OMF"
ID_SEISMIC_FRAME_TYPE_DES                     = "DES"
ID_SEISMIC_FRAME_TYPE_DMO                     = "DMO"
ID_SEISMIC_FRAME_TYPE_DMI                     = "DMI"
ID_SEISMIC_WALL_TYPE_SMF                      = "Special Structural Wall"
ID_SEISMIC_WALL_TYPE_IMF                      = "Intermediate Structural Wall"
ID_SEISMIC_WALL_TYPE_OMF                      = "Ordinary Structural Wall"

IDC_COMPRESSION_REBAR                         = "Compression Rebar"
IDC_DO_NOT_CONSIDER                           = "Do not Consider"
IDC_CONSIDER                                  = "Consider"

IDC_DPLUS_INP_BTN_APPLY                       = "Apply"
IDC_DPLUS_INP_BTN_CHECK                       = "Check"
IDC_DPLUS_INP_BTN_DESIGN                      = "Design"
IDC_DPLUS_INP_BTN_REPORT                      = "Report ..."
IDC_DPLUS_INP_BTN_PRINT                       = "Print ..."
IDC_DPLUS_INP_BTN_SAVE                        = "Save ..."

IDC_DPLUS_INP_BTN_SEL_ALL                     = "All"
IDC_DPLUS_INP_BTN_SEL_NONE                    = "None"
IDC_DPLUS_INP_BTN_SEL_INVERT                  = "Invert"
IDC_DPLUS_INP_BTN_EXCEL_FILE                  = "Excel File ..."
IDC_DPLUS_INP_BTN_AUTORESIZE                  = "Auto Resize"
IDS_SELECT_MEMBER                             = "Select Member."
IDS_IMPORT_SECTION                            = "Import Section"

IDC_DGN_BTN_EVAL_MEMB                         = "Evaluate Member"
IDC_DGN_BTN_EVAL_TOTL                         = "Evaluate Building ..."
IDC_DGN_BTN_EXCEL_OUT                         = "Excel File ..."
IDC_DGN_BTN_AUTO_SIZE                         = "Auto Resize"

IDC_DPLUS_LABEL_MEMB_NAME                     = "Member Name"
IDC_DPLUS_FRAME_GENERAL                       = "General"
IDC_DPLUS_LABEL_USE_TYPE                      = "Apply this Member to "

IDS_DOUBLE_CLICK_TO_ZOOM                      = "Double click to Zoom"
IDS_DOUBLE_CLICK_TO_CLOSE                     = "Double click to Close"

IDS_MOMENT                                    = "Moment"
IDS_SHEAR                                     = "Shear"
IDS_BENDING_MOMENT                            = "Bending Moment"
IDS_SHEAR_FORCE                               = "Shear Force"
IDS_MATERIAL                                  = "Material"
IDS_SECTION                                   = "Section"
IDS_STUD                                      = "Stud"
IDS_STUD_BOLT                                 = "Stud Bolt"
IDS_RIB                                       = "Rib"
IDS_RIB_PLATE                                 = "Rib Plate"

/////// IDD_MAIN_LCOM_DLG
IDD_MAIN_LCOM_DLG                             = "Load Combination"
IDC_MAIN_LCOM_FRAME                           = "Select Member List"
IDC_MAIN_LCOM_SYNC_CHK                        = "Synchronize the Main Program"
IDC_MAIN_LCOM_SYSTEM_STC                      = "System"
IDC_MAIN_LCOM_MEMBER_STC                      = "Type"
IDC_MAIN_LCOM_ELEM_STC                        = "Member"
IDC_MAIN_LCOM_SYNC_LBL                        = "(Check off : Hold the Current Set-Up)"
IDC_MAIN_LCOM_LBL_OPACITY                     = "Transparency"

/////// IDD_MAIN_WORKTREE_DOCK_PAGE
IDC_MAIN_ADD_MEMB_GROUP                       = "Add New Member"
IDC_MAIN_LIST_SYSTEM_STC                      = "System"
IDC_MAIN_LIST_MEMBER_STC                      = "Type"
IDC_MAIN_LIST_NAME_STC                        = "Name"
IDC_MAIN_LIST_ADD_BUTTON                      = "Add New Member"
IDC_MAIN_LIST_ADD_IMPORT                      = "Import"
IDC_MAIN_LIST_IMPORT_GNX                      = "Import from GEN NX"
IDC_MAIN_LIST_IMPORT_GEN                      = "Import from Gen"
IDC_MAIN_LIST_IMPORT_ADS                      = "Import from ADS"
IDC_MAIN_LIST_EXP_BUTTON                      = "Export"
IDC_MAIN_LIST_OPT_BUTTON                      = "Option..."
IDC_MAIN_LIST_ELEM_STC                        = "Member"
IDC_MAIN_LIST_NODE_STC                        = "Node"
IDC_MAIN_LIST_NOTE_BEAM                       = "All RC Beam data will be imported."
IDC_MAIN_LIST_NOTE_COLM                       = "All RC Column data will be imported."
IDC_MAIN_LIST_NOTE_WALL                       = "All wall data will be imported."
IDC_MAIN_LIST_CHK_KEEP                        = "Keep Sect. && Bar Data"
IDC_MAIN_LIST_DEL_BATCH_BEAM                  = "Existing batch beam data will be removed.\n\nDo you want to continue?"
IDC_MAIN_LIST_DEL_BATCH_COLM                  = "Existing batch column data will be removed.\n\nDo you want to continue?"
IDC_MAIN_LIST_DEL_BATCH_WALL                  = "Existing batch wall data will be removed.\n\nDo you want to continue?"

/////// IDD_MAIN_DRAW_DLG
IDC_DWG_LIST_BTN_CREATE                       = "Create"
IDC_DWG_LIST_BTN_SAVE                         = "Save As..."
IDC_DWG_LIST_BTN_BLOCKPRINT                   = "Print List"

/////// IDD_MAIN_PROTECTION_EX_OPT_KR_DLG
IDC_STATIC_COMMENT                            = " You can select your desired program options."
IDC_PRODUCT_OPTION_STC                        = "Options "
IDC_OPTION_SELECT_ALL                         = "Select All"
IDC_OPTION_SELECT_NONE                        = "Select None"
IDC_LBC_LOCKOPT_UPDATEBTN                     = "Update"
IDC_LBC_LOCKOPT_KR_CHK1                       = "Aluminum"
IDC_LBC_LOCKOPT_KR_CHK2                       = "Corrugated Web Beam"
IDC_LBC_LOCKOPT_KR_CHK3                       = "Data Export ( Gen )"

/////// IDD_MAIN_PROTECTION_EX_OPT_US_DLG
IDC_LBC_LOCKOPT_US_CHK1                       = "Exclude US code"
IDC_LBC_LOCKOPT_US_CHK2                       = "Eurocode"
IDC_LBC_LOCKOPT_US_CHK3                       = "IS Code"
IDC_LBC_LOCKOPT_US_CHK4                       = "KR Code"
IDC_LBC_LOCKOPT_US_CHK5                       = "Aluminum Code"
IDC_LBC_LOCKOPT_US_CHK6                       = "Batch Design"

/////// IDD_MAIN_PROTECTION_EX_OPT_CH_DLG
IDC_LBC_LOCKOPT_CH_CHK1                       = "US code"
IDC_LBC_LOCKOPT_CH_CHK2                       = "Eurocode"
IDC_LBC_LOCKOPT_CH_CHK3                       = "Other Code"
IDC_LBC_LOCKOPT_CH_CHK4                       = "Batch Design"

/////// IDD_MAIN_PROTECTION_EX_DLG
IDD_MAIN_PROTECTION_EX_DLG                    = "Register Protection License"
IDC_MAIN_RD1                                  = "Web Authentication"
IDC_MAIN_RD3                                  = "Other Type"
IDC_MAIN_RD4                                  = "Period Lock"
IDC_MAIN_REG_FRM_LICENSE                      = "License Authentication"
IDC_MAIN_STATIC_1                             = "User ID"
IDC_MAIN_STATIC_2                             = "Password"
IDC_MAIN_STATIC_US_PK                         = "Protection Key ID"
IDC_MAIN_PROXY_SERVER_CHK                     = "Use Proxy Server"
IDC_MAIN_PROTECT_OPTBTN                       = "Select Product"
IDC_MAIN_PROTECT_MEMBERSHIP_BTN               = "Create a New Account"
IDC_MAIN_STATIC_KEYNUMBER                     = "Key Number "
IDC_MAIN_STATIC_KEYTYPE                       = "Key Type "
IDC_MAIN_STATIC_PROTOCOL                      = "Protocol "
IDC_MAIN_SERVER_NAME_CHK                      = "Server Name or IP Address"
IDC_MAIN_STATIC_3                             = "Lock Type"
IDC_MAIN_RD2                                  = "S/W Lock Authentication"
IDC_MAIN_STATIC_COMMENT                       = " MUSS Identification"
IDC_MAIN_STATIC_4                             = "Key Number"
IDC_MAIN_SWL_HARDWAREID_BT                    = "Hardware ID"
IDC_MAIN_SWL_FIXCLOCK_BT                      = "Fix clock problem"
IDC_MAIN_STATIC_MODS1                         = "MIDAS On Demand Service"
IDC_MAIN_STATIC_MODS2                         = "Welcome to"
IDC_MAIN_STATIC_MODS3                         = "[ Design+ Ver.100 ]"
IDC_MAIN_CHK_STARTUP                          = "Do not display this dialog at startup"
IDC_MAIN_REG_RESET_BTN                        = "Reset"
IDC_MAIN_PERIOD_KEY_NUM_STC                   = "Key Number"
IDC_MAIN_PERIOD_HARD_ID_BTN					  = "Hardware ID"

/////// IDD_MAIN_PROXY_SERVER_DLG
IDC_MAIN_PROXY_SERVER_FRM                     = "Proxy Server Setting"
IDC_RDO_AUTO_DETECT                           = "Auto Detect"
IDC_RDO_MANUAL_SET                            = "Direct Setting"
IDC_MAIN_PROXY_ADDRESS_STC                    = "Proxy Server Address (ex: Proxy.midasit.com or IP address) and Port"
IDC_MAIN_PROXY_ADDRESS_STC2                   = "Address:"
IDC_MAIN_PROXY_PORT_STC                       = "Port:"
IDC_MAIN_PROXY_USER_INFO_CHK                  = "Need user name and password to access proxy server"
IDC_MAIN_PROXY_USERNAME_STC                   = "User Name:"
IDC_MAIN_PROXY_PASSWORD_STC                   = "Password:"

/////// IDD_MAIN_PERIOD_HARDWAREID
IDD_MAIN_PERIOD_HARDWAREID                    = "Hardware ID"

/////// IDD_MAIN_REORDER_MEMBER_LIST_DLG
IDD_MAIN_REORDER_MEMBER_LIST_DLG              = "Reorder Member List"
IDC_MAIN_LIST_MEMBER_FRM                      = "Select Member List"
IDC_MAIN_LIST_MEMB_LIST_FRM                   = "Member List"
IDC_MAIN_REORDER_SORT_BTN                     = "Sort"
IDC_MAIN_LIST_MEMB_SORT_FRM                   = "Reordered Member List"
IDC_MAIN_REORDER_UP_BTN                       = "Up"
IDC_MAIN_REORDER_DN_BTN                       = "Down"
IDC_MAIN_REORDER_APPLY_BTN                    = "Apply"

/////// IDD_MAIN_WORKTREE_GROUP
IDD_MAIN_WORKTREE_GROUP                       = "Member Grouping"
IDC_GROUP_ADD_BTN                             = "New"
IDC_GROUP_CPY_BTN                             = "Copy"
IDC_GROUP_MOD_BTN                             = "Modify"
IDC_GROUP_DEL_BTN                             = "Delete"
IDC_GROUP_UP_BTN                              = "Up"
IDC_GROUP_DOW_BTN                             = "Down"
IDC_GROUP_GR_ALL_BTN                          = "All"
IDC_GROUP_GR_NON_BTN                          = "None"
IDC_GROUP_GR_IVT_BTN                          = "Invert"
IDC_GROUP_DB_ALL_BTN                          = "All"
IDC_GROUP_DB_NON_BTN                          = "None"
IDC_GROUP_DB_IVT_BTN                          = "Invert"
IDC_GROUP_FRM_GROUP_LIST                      = "Group List"
IDC_GROUP_FRM_MEMB_GROUP                      = "Member in Group"
IDC_GROUP_FRM_MEMB_DB                         = "Member in DB"
IDC_GROUP_FRM_PROPERTY                        = "Property"
IDC_GROUP_LBL_PROP_NAME                       = "Name"
IDC_GROUP_LBL_PROP_APPLY                      = "Apply Group to"
IDC_GROUP_LBL_PROP_DESC                       = "Description"
IDC_GROUP_DB_CHK_NONGROUPONLY                 = "Non-grouped only"

/////// IDD_MAIN_STR_CONVERT_DLG
IDD_MAIN_STR_CONVERT_DLG                      = "String Converter ( ini File Generator )"
IDC_STR_CONVERT_FRM_FLDR                      = "Folder for Files"
IDC_STR_CONVERT_LBL_FLDH                      = ".h File"
IDC_STR_CONVERT_LBL_FLDI                      = ".ini File"
IDC_STR_CONVERT_FRM_OPTN                      = "Convert Option"
IDC_STR_CONVERT_CHK_AUTOTAB                   = "Automatic Tab Position"
IDC_STR_CONVERT_LBL_TABS                      = "Align Position ( Tab Number )"
IDC_STR_CONVERT_CHK_BLANK                     = "Remove Blank Lines."
IDC_STR_CONVERT_CHK_CMMNT                     = "Remove Comments."
IDC_STR_CONVERT_BTN_CNVRT                     = "Convert String"

/////// IDD_MAIN_STR_ALIGN_DLG
IDD_MAIN_STR_ALIGN_DLG                        = "String Aligner"
IDC_STR_ALIGN_FRM_FLDR                        = "Folder for ini Files"
IDC_STR_ALIGN_LBL_FLDB                        = "Before Align"
IDC_STR_ALIGN_LBL_FLDA                        = "After Align"
IDC_STR_ALIGN_FRM_OPTN                        = "Align Option"
IDC_STR_ALIGN_CHK_AUTOTAB                     = "Automatic Tab Position"
IDC_STR_ALIGN_LBL_TABS                        = "Align Position ( Tab Number )"
IDC_STR_ALIGN_CHK_BLANK                       = "Remove Blank Lines."
IDC_STR_ALIGN_CHK_CMMNT                       = "Remove Comments."
IDC_STR_ALIGN_BTN_ALIGN                       = "Align String"

/////// IDD_MAIN_STR_COPY_DLG
IDD_MAIN_STR_COPY_DLG                         = "Design Engine String File Copy Tool"
IDC_STR_COPY_FRM_FLDR                         = "Folder for Files"
IDC_STR_COPY_LBL_FLD_FR                       = "Design Engine Source Folder"
IDC_STR_COPY_LBL_FLD_TO                       = "Target Folder for INI Files"
IDC_STR_COPY_FRM_LANG                         = "Sub-fix for Language"
IDC_STR_COPY_LBL_LANG_EN                      = "English"
IDC_STR_COPY_LBL_LANG_KR                      = "Korean"
IDC_STR_COPY_LBL_LANG_CH                      = "Chinese"
IDC_STR_COPY_LBL_LANG_JP                      = "Japanese"
IDC_STR_COPY_LBL_LANG_RU                      = "Russian"
IDC_STR_COPY_LBL_LANG_TW                      = "Taiwanese"
IDC_STR_COPY_BTN_COPY                         = "Copy Files"
